{
  "is_default": false,
  "is_planetary": false,
  "priority": -1,
  "initial_state_name": "step1",
  "table": {
    "step1": [
      "How do you earn money here? Or as we call it, SB? It's fairly simple. So far, all you have to do is just fulfill simple delivery tasks.",
      [
        [
          "go_step2",
          "Great, now I'm shipping pizza?",
          "step2",
          [
          ],
          null
        ]
      ]
    ],
    "step2": [
      "Not exactly, but I'm not authorized to tell you what you will be carrying. Just don't ask questions, ok?",
      [
        [
          "go_step3",
          "And how do I do that?",
          "step3",
          [
            "TriggerTutorialQuest"
          ],
          null
        ],
        [
          "go_step1",
          "Hold on, I missed something. Can you repeat the previous step?",
          "step1",
          [],
          null
        ]
      ]
    ],
    "step3": [
      "See that line from your ship to a planet? All you have to do is to land there, and use 'work on delivery quest' option in the dialogue. That's it. A person will give you a crate, you get a destination, drop it there, and voilà - you get paid. However, this won't work during the tutorial - you have to play the real game. Why, you ask? Well, that feature is still in development.",
      [
        [
          "go_step4",
          "Sounds easy.",
          "step4",
          [],
          null
        ],
        [
          "go_step2",
          "Hold on, I missed something. Can you repeat the previous step?",
          "step2",
          [],
          null
        ]
      ]
    ],
    "step4": [
      "Exactly. Well, that's almost everything you need to know. Another thing is that in the main game you will be competing against other players, who will try to earn more money than you by doing the same thing. You will have to beat them to the first place in a limited time.",
      [
        [
          "go_step5",
          "I get it. Okay, thank you. Can I play now?",
          "",
          [
            {
              "SwitchDialogue": "tutorial_end"
            }
          ],
          null
        ],
        [
          "go_step3",
          "Hold on, I missed something. Can you repeat the previous step?",
          "step3",
          [],
          null
        ],
        [
          "go_beginning",
          "I don't get it at all. Can you repeat everything about the quests from the beginning?",
          "step1",
          [],
          null
        ],
        [
          "cancel",
          "I think I've had enough of this. Let me fly already!",
          "cancel_confirm",
          [],
          null
        ]
      ]
    ],
    "cancel_confirm": [
      "Oh well, I'm pretty sure you can handle it on your own. Good luck!",
      [
        [
          "quit",
          "See ya!",
          "",
          [
            "QuitTutorial"
          ],
          null
        ]
      ]
    ]
  },
  "bot_path": [],
  "name": "tutorial_quests",
  "portrait": "admin",
  "environment": "space"
}
